semestre_i/aoc/t1/t1.tex
% Created 2018-09-08 Sat 17:01
% Intended LaTeX compiler: pdflatex
\documentclass[
	% -- opções da classe memoir --
	12pt,				% tamanho da fonte
	openright,			% capítulos começam em pág ímpar (insere página vazia caso preciso)
	twoside,			% para impressão em recto e verso. Oposto a oneside
	a4paper,			% tamanho do papel. 
	% -- opções da classe abntex2 --
	%chapter=TITLE,		% títulos de capítulos convertidos em letras maiúsculas
	%section=TITLE,		% títulos de seções convertidos em letras maiúsculas
	%subsection=TITLE,	% títulos de subseções convertidos em letras maiúsculas
	%subsubsection=TITLE,% títulos de subsubseções convertidos em letras maiúsculas
	% -- opções do pacote babel --
	english,			% idioma adicional para hifenização
	french,				% idioma adicional para hifenização
	spanish,			% idioma adicional para hifenização
	brazil				% o último idioma é o principal do documento
	]{abntex2}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Gustavo de Paula}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Gustavo de Paula},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.13)}, 
 pdflang={English}}
\begin{document}
\imprimircapa
\imprimirfolhaderosto
\tableofcontents


\section{Conceitue os termos dados e informação, no que se refere a seu emprego em processamento de dados.}
\label{sec:org6d37a78}
Em processamento de dados, dados seria aquilo que é obtido de uma ou mais
fontes. E informação é o resultado do processamento. Um programa que processa
dados tem como entrada dados, e saída informações, de modo que, essas
informações possam satisfazer um determinado uso de uma pessoa ou grupo
\section{Caracterize as etapas principais de um processamento de dados.}
\label{sec:orgb71df10}
\begin{itemize}
\item Entrada: A coleta dos dados brutos.
\item Processamento: Organização e operacionalização desses dados
\item Saída: A informação produzida a partir dos dados processados.
\end{itemize}
\section{Conceitue um sistema. Cite dois exemplos práticos de organizações sistêmicas na vida real.}
\label{sec:org33fce1e}
Segundo o livro IOC, um sistema é um “Conjunto de partes coordenadas que
concorrem para a realização de um determinado objetivo”. Podemos citar alguns
exemplos de sistemas na vida real:
\begin{itemize}
\item Sistema jurídico, onde partes se coordenam para estabelecer contratos, julgar
conflitos e fazer cumprir as regras.
\item Sistema de transporte, onde partes se coordenam para possibilitar o trajeto de
um ponto A para um ponto B.
\end{itemize}
\section{Considerando a organização de sistemas de informação definida no item 1.1.4, cite os níveis existentes e dê exemplos práticos de sistemas em cada um dos níveis relacionados.}
\label{sec:orge07ea7c}
Para citar exemplos práticos de sistemas em cada nível, usarei o exemplo de uma
empresa de motoboys como a Loggi.
\begin{itemize}
\item Nível operacional - seria um sistema que processasse qual a melhor rota para o
motoboy seguir.
\item Nível gerencial - seria um sistema (ou processos manuais) que coletasse dados
de como um certo produto está performando para que se possa tomar decisões do
que precisa melhorar e o que precisa continuar.
\item Alto nível da organização - seria um sistema (ou processos manuais) que fossem
capazes de prover informações para que conselho executivo seja capaz de
decidir se um novo produto deve ser lançado ou algum cortado.
\end{itemize}
\section{O que você entende por um programa de computador?}
\label{sec:orgcf1ca0a}
Programa de computador são um conjunto de passos que um ou mais determinados
computadores sejam capazes de executar.
\section{Conceitue os termos hardware e software.}
\label{sec:org7ce455e}
Hardware são componentes físicos que em conjunto são capazes de rodar um
conjunto de instruções. Software é esse conjunto de instruções que o Hardware é
capaz de rodar.
\section{O que é e para que serve uma linguagem de programação de computador? Cite exemplos de linguagens de programação.}
\label{sec:orga73e533}
Computadores só conseguem ler instruções que estejam em linguagem de máquina
(binário). Porém, apesar de possível, é extremamente difícil de entender,
escrever e manter sistemas em linguagem de máquina. As linguagens de programação
são uma camada de abstração entre a linguagem de máquina e o programador,
fazendo que possam ser desenvolvidos programas maiores e mais complexos e com
maior facilidade.
\section{Quem desenvolveu a máquina analítica?}
\label{sec:org496d137}
Charles Babbage
\section{Qual foi a característica marcante do censo de 1890 dos EUA, no que se refere à contabilização dos dados levantados?}
\label{sec:orgb0fe712}
A característica marcante do censo de 1890 foi a velocidade na contabilização e
processamento dos dados. Mesmo havendo um aumento populacional, o censo daquele
ano conseguiu ser apurado 4 vezes mais rápido do que a iteração anterior.
\section{Qual foi o propósito que conduziu ao desenvolvimento do primeiro computador eletrônico do mundo?}
\label{sec:org58dbb6e}
O propósito foi a baixa velocidade de processamento e a falta de confiabilidade,
ambos devidos á sua parte mecânica.
\section{Qual foi o primeiro microprocessador de 8 bits lançado comercialmente? Qual o nome da empresa proprietária?}
\label{sec:org8b09699}
O primeiro microprocessador de 8-bits lançado comercialmente foi o Intel 8008,
da Intel.
\section{Quais eram as características básicas da arquitetura proposta pelo Dr. John von Neumann?}
\label{sec:org38e753f}
\begin{itemize}
\item A dificuldade de programar a recolocação da fiação
\item Tipo de aritmética (decimal para binário)
\end{itemize}
\section{Qual a importância do computador Altair para a evolução da computação comercial?}
\label{sec:org5081c47}
Foi o primeiro computador com preço acessível a ser comercializado em grande
escala para os usuários domésticos e que teve boa aceitação.
\section{O que você entende por sistema digital? Qual seria a alternativa na computação se não existissem máquinas digitais?}
\label{sec:org2542e00}
Sistema digital é um sistema que segue a definição da questão 3, porém usa
sinais digitais que usam valores discretos (descontínuos). A alternativa à
máquinas digitais seriam máquinas analógicas, que trabalham com valores
contínuos.
\section{O que conduziu o pensamento dos pesquisadores para desenvolver computadores que somente usam o sistema binário e não, por exemplo, o sistema decimal?}
\label{sec:orgf7e99ee}
A dificuldade e o custo de construir uma máquina capaz de representar
confiavelmente 10 níveis de tensão em vez de apenas dois.
\section{Cite empresas brasileiras que comercializam computadores com sua própria marca.}
\label{sec:orgf91e7b5}
\begin{itemize}
\item Positivo
\item Itautec
\item CCE
\end{itemize}
\section{Qual foi o primeiro equipamento utilizado no mundo para realizar cálculos matemáticos?}
\label{sec:org12ec8e5}
O primeiro equipamento foi o ábaco.
\section{Considerando o formato das instruções do processador IAS (ver Fig. 1.12), indique qual deverá ser a máxima quantidade de instrução que o IAS poderia ter.}
\label{sec:orga975c2a}
A quantidade máxima de instrução seria 256.
\section{Uma das versões do processador Pentium 111 possui endereços de 36 bits em vez do tradicional de 32 bits. Qual deveria ser a capacidade máxima de endereçamento naqueles processadores?}
\label{sec:org6805a9e}
A capacidade máxima seria de 64G
\section{O ENIAC é usualmente conhecido como sendo o primeiro computador fabricado (máquina eletrônica de processamento de dados). No entanto, antes dele pelo menos dois outros cientistas desenvolveram equipamentos eletrônicos de computação, embora sem terem tido o devido crédito. Quais foram os cientistas e suas máquinas maravilhosas?}
\label{sec:org3e2e5de}
\begin{itemize}
\item John V. Atanasoff: Calculadora de resolução de equações lineares.
\item Alan Turing: Computador Colossus.
\end{itemize}
\section{Qual foi a primeira linguagem de programação de alto nível desenvolvida? Qual seu objetivo principal?}
\label{sec:org46bf475}
FORTRAN foi a primeira linguagem de alto nível desenvolvida e amplamente usada.
O seu objetivo principal era a elaboração de programas científicos.
\section{Pense em algumas vantagens globais obtidas pelo uso de máquinas para realizar processamento de dados em substituição ao ser humano.}
\label{sec:org14cf0d2}
O uso de máquinas em vez do humano para realizar o processamento de dados nos
permite uma maior precisão e capacidade de processamento para todos nós. Isso
também permite mais pessoas se especializarem em outras áreas que não sejam o
puro processamento de dados.
\end{document}
